app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  	@book = Book.new
  	@books = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaa"], ["body", "aaa"], ["created_at", "2019-08-16 10:29:48.361759"], ["updated_at", "2019-08-16 10:29:48.361759"]]
---
  def create
  	book = Book.new(book_params)
  	book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2019-08-16 12:28:26.236578"], ["id", 1]]
---
  def update
  book = Book.find(params[:id])
  book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
  book = Book.find(params[:id])
  book.destroy